# https://gist.github.com/ChristopherA/a579274536aab36ea9966f301ff14f3f

tap "homebrew/bundle"
tap "buo/cask-upgrade"

# Console
brew "antidote"
brew "bash"
brew "bat"
brew "curl"
brew "difftastic"
brew "fish"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gh"
brew "grpcurl"
brew "gum"
brew "httpie"
brew "jless"
brew "jid"
brew "jq"
brew "mas"
brew "neovim"
brew "nushell"
brew "powerlevel10k"
brew "restic"
brew "stow"
brew "tmux"
brew "trash"
brew "tree"
brew "wget"
brew "zsh"
brew "zsh-completions"

# OSX Apps
cask "arc"
cask "charles"
cask "cleanmymac"
cask "dash"
cask "iterm2"
cask "obsidian"
cask "osquery"
cask "visual-studio-code"
cask "wireshark"
cask "zoom"

brew "batchcorp/public/plumber"
brew "goreleaser/tap/goreleaser"
brew "isacikgoz/taps/gitbatch"
brew "isacikgoz/taps/gitin"
brew "isacikgoz/taps/tldr"
brew "mergestat/mergestat/mergestat"
brew "rs/tap/curlie"
brew "traefik/tap/yaegi"

# Languages, protocols, tools
brew "python"
brew "pipx"
brew "ruby"
brew "go"
brew "protobuf"
brew "nvm"

# Containers
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
brew "skaffold"
brew "lima"
brew "helm"
brew "kubectx"
brew "kubernetes-cli"